Revit 2024 API
StructuralSection.WarpingConstant Property
 Warping constant (Cw, Iomega, H).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double WarpingConstant { get; set; }
Visual Basic
Public Property WarpingConstant As Double
	Get
	Set
Visual C++
public:
property double WarpingConstant {
	double get ();
	void set (double value);
}
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace